app/views/questions/_question.html.erb

<!--hidden  invisible -->
<div class="card bg-primary text-primary-content h-full w-full absolute question" data-controller="questions" data-order="<%= question.order %>" data-total="<%= question_length(question) %>" >
---
SELECT "questions".* FROM "questions"