app/controllers/questions_controller.rb

  def index
    @questions = Question.all
    @answers = Array.new(@questions.length)
---
SELECT "questions".* FROM "questions"

  def calculate_answer
    answers = params[:answers]

    # No answers received
    unless answers.present?
      redirect_to result_path
    end

    # Sum up key by category
    score_by_category = {}
    question_per_category = {}
    answers.each do |question_id, selected_option|
      question = Question.find_by(id: question_id)
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]